app/controllers/blogs_controller.rb

  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save
---
INSERT INTO "blogs" ("title", "content", "author", "social", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)